thinflatplate_move/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    sidewall
    {
      type            fixedValue;
       value           uniform (0 0 0);
    }

    inlet
    {
      type            fixedValue;
       value           uniform (0 0 0);
    }

    outlet
    {
      type            fixedValue;
       value           uniform (0 0 0);
    }

    lowerwall
    {
      type            fixedValue;
       value           uniform (0 0 0);
    }

    upperwall
    {
      type            fixedValue;
       value           uniform (0 0 0);
    }

    flatplate
    {
        type            solidBodyMotionDisplacement;
	       solidBodyMotionFunction tabulated6DoFMotion;
	        CofG (0 0 0);
        timeDataFileName "$FOAM_CASE/constant/flatplate30.dat";
     }
}

// ************************************************************************* //
