thinflatplate_move/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs
{
    type            forceCoeffs;

    libs            (forces);
    writeControl    timeStep;
    timeInterval    1;
    log             yes;

    patches         (flatplate);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.0;           // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         1.0;
    lRef            0.01;        // Wheelbase length
    Aref            0.0002;        // Estimated
}



// ************************************************************************* //
